{
  "recipes": [
    {
      "id": 1,
      "name": "Crock Pot Roast",
      "ingredients": "1 beef roast, 1 package brown gravy mix, 1 package dried Italian salad dressing mix, 1 package dry ranch dressing mix, 1/2 cup water",
      "steps": "Place beef roast in crock pot. Mix the dried mixes together in a bowl and sprinkle over the roast. Pour the water around the roast. Cook on low for 7-9 hours",
      "imageURL": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/27/20/8/picVfzLZo.jpg",
      "originalURL": "http://www.food.com/recipe/to-die-for-crock-pot-roast-27208",
      "likes": 0
    },
    {
      "id": 2,
      "name": "Roasted Asparagus",
      "ingredients": "1 lb asparagus, 1 1/2 tbsp olive oil, 1/2 tsp kosher salt",
      "steps": "Preheat oven to 425°F. Cut off the woody bottom part of the asparagus spears and discard. With a vegetable peeler, peel off the skin on the bottom 2-3 inches of the spears (this keeps the asparagus from being all.\",string.\", and if you eat asparagus you know what I mean by that). Place asparagus on foil-lined baking sheet and drizzle with olive oil. Sprinkle with salt. With your hands, roll the asparagus around until they are evenly coated with oil and salt. Roast for 10-15 minutes, depending on the thickness of your stalks and how tender you like them. They should be tender when pierced with the tip of a knife. The tips of the spears will get very brown but watch them to prevent burning. They are great plain, but sometimes I serve them with a light vinaigrette if we need something acidic to balance out our meal",
      "imageURL": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/50/84/7/picMcSyVd.jpg",
      "originalURL": "http://www.food.com/recipe/roasted-asparagus-50847",
      "likes": 0
    },
    {
      "id": 3,
      "name": "Curried Lentils and Rice",
      "ingredients": "1 quart beef broth, 1 cup dried green lentils, 1/2 cup basmati rice, 1 tsp curry powder, 1 tsp salt",
      "steps": "Bring broth to a low boil. Add curry powder and salt. Cook lentils for 20 minutes. Add rice and simmer for 20 minutes. Enjoy!",
      "imageURL": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4MeMpudTU2HY-1yHxrsAk70MnQu9xVb4KUQ&usqp=CAU",
      "likes": 0
    },
    {
      "id": 4,
      "name": "Big Night Pizza",
      "ingredients": "5 teaspoons yeast, 5 cups flour, 4 tablespoons vegetable oil, 2 tablespoons sugar, 2 teaspoons salt, 2 cups hot water, 1/4 cup pizza sauce, 3/4 cup mozzarella cheese",
      "steps": "Add hot water to yeast in a large bowl and let sit for 15 minutes. Mix in oil, sugar, salt, and flour and let sit for 1 hour. Knead the dough and spread onto a pan. Spread pizza sauce and sprinkle cheese. Add any optional toppings as you wish. Bake at 400 deg Fahrenheit for 15 minutes. Enjoy!",
      "imageURL": "http://upload.wikimedia.org/wikipedia/commons/c/c7/Spinach_pizza.jpg",
      "likes": 0
    },
    {
      "id": 5,
      "name": "Cranberry and Apple Stuffed Acorn Squash Recipe",
      "ingredients": "2 acorn squash, 1 boiling water, 2 apples chopped into 1.4 inch pieces, 1/2 cup dried cranberries, 1 teaspoon cinnamon, 2 tablespoons melted butter",
      "steps": "Cut squash in half, remove seeds. Place squash in baking dish, cut-side down. Pour 1/4-inch water into dish. Bake for 30 minutes at 350 degrees F. In large bowl, combine remaining ingredients. Remove squash from oven, fill with mix. Bake for 30-40 more minutes, until squash tender. Enjoy!",
      "imageURL": "http://elanaspantry.com/wp-content/uploads/2008/10/acorn_squash_with_cranberry.jpg",
      "originalURL": "",
      "likes": 0
    },
    {
      "id": 6,
      "name": "Mic's Yorkshire Puds",
      "ingredients": "200g plain flour, 3 eggs, 300ml milk, 3 tbsp vegetable oil",
      "steps": "Put the flour and some seasoning into a large bowl., Stir in eggs, one at a time., Whisk in milk until you have a smooth batter., Chill in the fridge for at least 30 minutes., Heat oven to 220C/gas mark 7., Pour the oil into the holes of a 8-hole muffin tin., Heat tin in the oven for 5 minutes., Ladle the batter mix into the tin., Bake for 30 minutes until well browned and risen",
      "imageURL": "http://upload.wikimedia.org/wikipedia/commons/f/f9/Yorkshire_Pudding.jpg",
      "originalURL": "http://upload.wikimedia.org/wikipedia/commons/f/f9/Yorkshire_Pudding.jpg",
      "likes": 0
    },
    {
      "id": 7,
      "name": "Old-Fashioned Oatmeal Cookies",
      "ingredients": "1 cup raisins, 1 cup water, 3/4 cup shortening, 1 1/2 cups sugar, 2 1/2 cups flour, 1 tsp. soda, 1 tsp. salt, 1 tsp. cinnamon, 1/2 tsp. baking powder, 1/2 tsp. cloves, 2 cups oats, 1/2 cup chopped nuts",
      "steps": "Simmer raisins and water over medium heat until raisins are plump, about 15 minutes., Drain raisins, reserving the liquid., Add enough water to reserved liquid to measure 1/2 cup., Heat oven to 400°., Mix thoroughly shortening, sugar, eggs and vanilla., Stir in reserved liquid., Blend in remaining ingredients., Drop dough by rounded teaspoonfuls about 2 inches apart onto ungreased baking sheet., Bake 8 to 10 minutes or until light brown, About 6 1/2 dozen cookies.",
      "imageURL": "http://s3.amazonaws.com/gmi-digital-library/65caecf7-a8f7-4a09-8513-2659cf92871e.jpg",
      "originalURL": "#",
      "likes": 0
    },
    {
      "id": 8,
      "name": "Blueberry Oatmeal Squares",
      "ingredients": "2-1/2 cups rolled oats, (not instant), 1-1/4 cups all-purpose flour, 1 tbsp grated orange rind, 1/4 tsp salt, 1 cup cold butter - cubed, 1/4 cup packed brown sugar, 3 cups fresh blueberries, 1/2 cup granulated sugar, 1/3 cup orange juice, 4 tsp cornstarch",
      "steps": "Filling: In saucepan, bring blueberries, sugar and orange juice to boil; reduce heat and simmer until tender, about 10 minutes, Whisk cornstarch with 2 tbsp (25 mL) water; whisk into blueberries and boil, stirring, until thickened, about 1 minute., Place plastic wrap directly on surface; refrigerate until cooled, about 1 hour., In large bowl, whisk together oats, flour, sugar, orange rind and salt ; with pastry blender, cut in butter until in coarse crumbs., Press half into 8-inch (2 L) square parchment paper–lined metal cake pan; spread with blueberry filling., Bake in centre of 350°F oven until light golden, about 45 minutes., Let cool on rack before cutting into squares., (Make-ahead: Cover and refrigerate for up to 2 days or overwrap with heavy-duty foil and freeze for up to 2 weeks.)",
      "imageURL": "https://m1.quebecormedia.com/emp/cl_prod/canadian_living-_-ec57f7d6-e56e-4b5e-9a51-fb1300b3e421-_-blueberry-oatmeal-squares2501359401339.jpg?impolicy=resize&width=1500&height=1500",
      "originalURL": "http://www.canadianliving.com/food/blueberry_oatmeal_squares.php",
      "likes": 0
    },
    {
      "id": 9,
      "name": "Curried chicken salad",
      "ingredients": "3 skinless, boneless chicken breasts - halved lengthwise, 1/2 cup mayonnaise, 1 tbsp lemon zest, 1 tbsp lemon juice, 1 1/2 tsp curry powder, 1/4 tsp salt, 2 ripe mangoes - diced, 1/4 cup dried cranberries, 2 green onions - thinly sliced, 1 celery stalk - finely chopped, 6 leaves Boston lettuce, 6 English muffins, toasted",
      "steps": "ARRANGE chicken in a single layer in a large pot, Add water to just cover, Bring to a boil over medium-high, Flip chicken, reduce heat to medium and simmer until cooked, about 6 more min, Cool, STIR mayo with lemon zest, juice, curry and salt in large bowl, Using 2 forks, shred chicken, then stir into mayo mixture with mango, cranberries, green onions and celery, Divide among muffins with lettuce leaves, Sandwich with tops",
      "imageURL": "http://www.chatelaine.com/wp-content/uploads/2013/05/Curried-chicken-salad.jpg",
      "originalURL": "http://www.chatelaine.com/recipe/stovetop-cooking-method/curried-chicken-salad/",
      "likes": 0
    },
    {
      "name": "Baked Feta Pasta",
      "ingredients": "2 pt. cherry or grape tomatoes, 1 shallot - quartered, 3 cloves garlic - smashed, 1/2 c. extra-virgin olive oil-divided, Kosher salt, Pinch crushed red pepper flakes, 1 (8-oz.) block feta, 3 sprigs fresh thyme, 10 oz. pasta, Zest of 1 lemon (optional), Fresh basil - for garnish",
      "steps": "Preheat oven to 400°. In a large ovenproof skillet or medium baking dish, combine tomatoes, shallot, garlic, and all but 1 tablespoon oil. Season with salt and red pepper flakes and toss to combine., Place feta into center of tomato mixture and drizzle with remaining 1 tablespoon oil. Scatter thyme sprigs over tomatoes. Bake for 40 to 45 minutes, until tomatoes are bursting and feta is golden on top., Meanwhile, in a large pot of boiling salted water, cook pasta until al dente according to package directions. Reserve ½ cup pasta water before draining., To skillet with tomatoes and feta, add cooked pasta, reserved pasta water, and lemon zest (if using) and stir until combined. Garnish with basil. ",
      "imageURL": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRiEzDcM7GOluGb0UvFU6zvYOPFhSgGRBHmcg&usqp=CAU",
      "originalURL": "https://www.delish.com/cooking/recipe-ideas/a35421563/baked-feta-pasta-tiktok/",
      "id": 10,
      "likes": 0
    },
    {
      "name": "Air Fryer Pork Chops  ",
      "ingredients": "4 boneless pork chops, about 1\"-thick,\n2 tbsp. extra-virgin olive oil,\n1/2 c. freshly grated Parmesan,\n1 tsp. kosher salt,\n1 tsp. paprika,\n1 tsp. garlic powder,\n1 tsp. onion powder,\n1/2 tsp. freshly ground black pepper, ",
      "steps": "Pat pork chops dry with paper towels, then coat both sides with oil. In a medium bowl, combine Parmesan and spices. Coat both sides of pork chops with Parmesan mixture., Place pork chops in basket of air fryer and cook at 375° until internal temperature reaches 145°, about 9 minutes, flipping halfway through.",
      "imageURL": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-190618-air-fryer-pork-chops-195-landscape-pf-1561578417.png?resize=980:*",
      "originalURL": "https://www.delish.com/cooking/recipe-ideas/a28091838/air-fryer-pork-chops-recipe/",
      "id": 11,
      "likes": 0
    },
    {
      "name": "AVOCADO PESTO PASTA",
      "ingredients": "8 oz Pasta of Choice,\nFlesh of 1 large Avocado,\n3 oz Fresh Basil, de-stemmed,\n½ bunch Parsley, de-stemmed,\n3–5 cloves of Garlic,\n¼ cup Nutritional Yeast,\nJuice + Zest of 1 Lemon,\n¼ tsp Red Chili Flakes (Optional),\n¼ cup Vegetable Broth, plus more to preference,\n½ tsp Salt, plus more to taste",
      "steps": "Bring a large pot of salted water to a boil and cook your Pasta according to the package instructions., In the meantime, combine all of the Pesto ingredients in a Food Processor and process until evenly incorporated. If you’d like your Pesto to be thinner, add additional Vegetable Broth in 2 tbsp increments as necessary., Drain the pasta, then return to the Pot and toss over low heat with the Pesto until warmed. Serve as desired. Store any leftover sauce in the fridge for up to one week, or it can be frozen for up to one month!",
      "imageURL": "https://frommybowl.com/wp-content/uploads/2019/03/Avocado_Pesto_Pasta_Vegan_GlutenFree_OilFree_FromMyBowl-6-1170x1755.jpg",
      "originalURL": "https://frommybowl.com/avocado-pesto-pasta/",
      "id": 12,
      "likes": 0
    },
    {
      "name": "Air Fryer Salmon",
      "ingredients": "4 salmon fillets 6 ounces each,\n1 tablespoon olive oil,\n1 teaspoon garlic powder,\n½ teaspoon paprika,\nSalt and pepper to taste,\nLemon wedges for serving,\nTartar sauce for serving,",
      "steps": "Preheat the air fryer to 400°F., Rub each fillet with olive oil and season with garlic powder, paprika, salt and pepper. Place the salmon in the air fryer and air fry for 7-9 minutes, depending on this thickness of the salmon. Please note, time may vary between air fryers., Open basket and check for desired doneness with a fork. You can return the salmon for another 1 or 2 minutes as necessary.",
      "imageURL": "https://feelgoodfoodie.net/wp-content/uploads/2020/01/Air-Fryer-Salmon-5.jpg",
      "originalURL": "https://feelgoodfoodie.net/recipe/air-fryer-salmon/",
      "id": 13,
      "likes": 0
    },
    {
      "name": "Guacamole",
      "ingredients": "3 avocados - peeled, pitted, and mashed,\n1 lime - juiced \n1 teaspoon salt,\n½ cup diced onion, \n3 tablespoons chopped fresh cilantro,\n2 roma (plum) tomatoes - diced,\n1 teaspoon minced garlic,\n1 pinch ground cayenne pepper (Optional)",
      "steps": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately.",
      "imageURL": "https://www.cookingclassy.com/wp-content/uploads/2018/01/guacamole-12.jpg",
      "originalURL": "https://www.allrecipes.com/recipe/14231/guacamole/",
      "id": 14,
      "likes": 0
    },
    {
      "name": "Gluten Free Chocolate Chip Cookies",
      "ingredients": "1 stick butter, ½ cup,\n1 tablespoon milk - or almond milk,\n¾ cup brown sugar,\n¼ cup white sugar,\n1 egg,\n2 teaspoons vanilla,\n1 ⅓ cups gluten-free all-purpose flour,\n¼ cup almond flour - 1 ounce,\n1 teaspoon baking soda,\n½ teaspoon salt,\n1 cup chocolate chips,\nSea salt for sprinkling -optional",
      "steps": "In a medium bowl, whisk together the gluten-free flour, almond flour, baking soda and salt until evenly combined. Set aside.,\nMelt butter in a saucepan over medium heat. Once the butter is melted start to whisk constantly. First the butter will begin to foam, then after a couple of minutes it will begin to brown on the bottom of the saucepan. Turn off the heat as soon as the solids turn brown and the butter gives off a nutty aroma. Pour into a glass mixing bowl to prevent burning.,\nAdd the milk, brown sugar and white sugar. Whisk to combine. Add the egg and vanilla and whisk until smooth and creamy.,\nUsing a rubber spatula, mix in the dry ingredients until well combined. Stir in the chocolate chips.,\nCover the bowl and let sit for 30 minutes. Preheat the oven to 350F. Scoop the cookie dough (about 2 Tablespoons of dough per cookie) and place a few inches apart on the baking sheets. Bake for 10-12 minutes, until golden and the center is set.,\nLet cool 5 minutes then transfer to a wire rack to continue cooling. Enjoy!",
      "imageURL": "https://meaningfuleats.com/wp-content/uploads/2018/06/IMG_1300-683x1024.jpg",
      "originalURL": "https://meaningfuleats.com/the-best-gluten-free-chocolate-chip-cookies/#recipe-card",
      "id": 15,
      "likes": 0
    },
    {
      "name": "Roasted Broccoli",
      "ingredients": "12 ounces broccoli florets,\nExtra-virgin olive oil - for drizzling,\nSea salt and freshly ground black pepper,\nMeyer lemons -halved - optional,\nRed pepper flakes - optional",
      "steps": "Preheat the oven to 400°F and line a baking sheet with parchment paper.,\nPlace the broccoli florets and lemon halves on the baking sheet. Toss with olive oil, salt, and pepper, and spread evenly on the baking sheet.,\nRoast 15 to 22 minutes or until browned around the edges. Squeeze a little lemon juice onto the broccoli and sprinkle with red pepper flakes - if desired.,",
      "imageURL": "https://cdn.loveandlemons.com/wp-content/uploads/2020/01/roasted-broccoli.jpg",
      "originalURL": "https://www.loveandlemons.com/roasted-broccoli/#wprm-recipe-container-42137",
      "id": 16,
      "likes": 0
    },
    {
      "name": "Baked Oats",
      "ingredients": "1 large ripe banana,\n1/4 cup of maple syrup,\n2/3 cup of milk (plant based as desired),\n3 tablespoons of nut butter,\n1 teaspoon of vanilla,\n1 cup of old fashioned oats,\n1/2 tablespoon of baking powder,\n1/2 teaspoon of baking soda,\npinch of salt,\noptional: 1/2 teaspoon of cinnamon OR 2 tablespoons of cocoa powder for the double choc version,\n1/2 cup of optional mix-ins such as berries, chocolate chips, etc",
      "steps": "Pre-heat the oven to 350 degrees F and grease a small casserole dish. Mine is a unique size of 6×8 but anything close to that will work including a 9×5 bread loaf pan or an 8×8-inch brownie pan (although you might want to slightly alter the baking time depending on your size).,\nAdd all ingredients to a blender MINUS your mix-ins. Blend until creamy and little to no chunks of the oats remain. Mix in berries or anything else you desire.,\nPour batter into the greased baking dish and top with any mix-ins as desired. Bake for 20-25 minutes (mine was perfect at 25 minutes) or until a toothpick inserted in the middle comes out clean.",
      "imageURL": "https://foodwithfeeling.com/wp-content/uploads/2021/02/baked-oats-2.jpg",
      "originalURL": "https://foodwithfeeling.com/baked-oats-tiktok/",
      "id": 17,
      "likes": 0
    },
    {
      "name": "Roasted Sweet Potatoes",
      "ingredients": "\n3 pounds sweet potatoes, peeled, cut into 1½-inch pieces\n¼ cup olive oil,\n2 teaspoons kosher salt,\n½ teaspoon freshly ground black pepper",
      "steps": "Preheat oven to 450°. Toss potatoes, oil, salt, and pepper on a rimmed baking sheet.,\nRoast, tossing occasionally, until tender and browned, 35–45 minutes.",
      "imageURL": "https://assets.bonappetit.com/photos/57acd5cef1c801a1038bc7f3/1:1/w_960,c_limit/ROAST-VEG-4-of-7.jpg",
      "originalURL": "https://www.bonappetit.com/recipe/roasted-sweet-potatoes",
      "id": 18,
      "likes": 0
    },
    {
      "name": "Best Mashed Potatoes",
      "ingredients": "3 lb. mixed potatoes, such as russets & Yukon Golds,\nKosher salt,\n1/2 c. (1 stick) butter, plus 2 tablespoons for garnish,\n1/2 c. whole milk,\n1/2 c. sour cream,\nFreshly ground black pepper",
      "steps": "In a large pot, cover potatoes with water and add a generous pinch of salt. Bring to a boil and cook until totally soft, 16 to 18 minutes. Drain and return potatoes to pot.\nUse a potato masher to mash potatoes until smooth.,\nMeanwhile, in a small saucepan, melt butter with milk until warm.,\nPour over warm milk-butter mixture and stir until completely combined and creamy. Add sour cream and stir until combined.,\nSeason mashed potatoes generously with salt and pepper.,\nTransfer potatoes to a serving bowl and top with remaining two tablespoons butter. Season with more pepper before serving.",
      "imageURL": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-mashed-potatoes-021-1541716941.jpg?crop=1xw:1xh;center,top&resize=980:*",
      "originalURL": "https://www.delish.com/cooking/recipe-ideas/recipes/a50630/perfect-mashed-potatoes-recipe/",
      "id": 19,
      "likes": 0
    },
    {
      "name": "Banana Bread",
      "ingredients": "1 Stick (½ Cup) Butter,\n3 Large Ripe Bananas,\n2 Large Eggs,\n1 teaspoon Vanilla Extract,\n2 Cups All Purpose Flour,\n1 Cup Granulated Sugar,\n1 teaspoon Baking Soda,\n½ teaspoon salt,\n½ teaspoon cinnamon",
      "steps": "Preheat oven to 350 degrees. Spray a loaf pan with non-stick cooking spray or grease with butter and set aside.,\nAdd the stick of butter to a large bowl and microwave for 1 minute, or until melted.\nAdd the bananas to the same bowl and mash with a fork.,\nAdd the vanilla extract and egg to the bowl and use the same fork to mash and stir until no yellow streaks of egg remain.\nIn a second large bowl whisk together the flour, sugar, baking soda, salt, and cinnamon.,\nAdd the dry ingredients to the wet ingredients and mix together with a spatula just until combined.,\nPour the batter into prepared loaf pan and bake for 45-55 minutes until a toothpick inserted in the center of the bread comes out clean.",
      "imageURL": "https://thesaltymarshmallow.com/wp-content/uploads/2018/11/banana-bread.jpg",
      "originalURL": "https://thesaltymarshmallow.com/best-banana-bread-recipe/#recipe",
      "id": 20,
      "likes": 0
    }
  ]
}